Tekla Open API Reference for Tekla Structures 2025
StructuresFieldAttribute Constructor
 The custom attribute [StructuresField(attributeName)] uses this to map a database attribute to a data field that the plug-in uses in execution. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public StructuresFieldAttribute(
	string attributeName
)
Public Sub New (
	attributeName As String
)
Parameters
attributeName
Type: System.String
The name of the attribute.
See Also
Reference
StructuresFieldAttribute Class
Tekla.Structures.Plugins Namespace